电脑/python/第三方模块/faker模块.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-03-30 三 18:28 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>faker模块</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">faker模块</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 简介</a></li>
<li><a href="#orgheadline2">2. faker所含方法清单</a></li>
<li><a href="#orgheadline3">3. 设置随机种子</a></li>
<li><a href="#orgheadline4">4. 语言locale代码</a></li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">简介</h2>
<div class="outline-text-2" id="text-1">
<p>
faker模块是一个很有特色的模块，所以其在github上得到的star也较多。其可以用来生成一些伪数据，比如用来做测试用途等等。其github项目地址在 <a href="https://github.com/joke2k/faker">这里</a> 。
</p>

<p>
该项目支持pip安装:
</p>
<pre>
sudo pip install fake-factory
</pre>

<p>
其使用还是很简单的，大概如下所示:
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">faker</span> <span class="kn">import</span> <span class="n">Factory</span>

<span class="n">faker</span> <span class="o">=</span> <span class="n">Factory</span><span class="o">.</span><span class="n">create</span><span class="p">()</span>

<span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="mi">50</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="n">faker</span><span class="o">.</span><span class="n">name</span><span class="p">())</span>
</pre></div>




<p>
然后中文名字例子如下，就是在Factory的create方法那里指定语言locale（默认是"en_EN"）:
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">faker</span> <span class="kn">import</span> <span class="n">Factory</span>

<span class="n">faker</span> <span class="o">=</span> <span class="n">Factory</span><span class="o">.</span><span class="n">create</span><span class="p">(</span><span class="s1">&#39;zh_CN&#39;</span><span class="p">)</span>

<span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="mi">100</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="n">faker</span><span class="o">.</span><span class="n">name</span><span class="p">())</span>
</pre></div>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline2">faker所含方法清单</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>address()</dt><dd>地址</dd>
<dt>text()</dt><dd>显示一段随机文本，没有中文化。</dd>
<dt>mime_type()</dt><dd>model/x3d+xml</dd>
<dt>chrome()</dt><dd>随机的user_agent , 这个很有用。</dd>
<dt>firefox()</dt><dd>火狐随机user_agent</dd>
<dt>internet_explorer()</dt><dd>ie随意user_agent</dd>
<dt>opera()</dt><dd>opera</dd>
<dt>safari()</dt><dd>safari</dd>
<dt>user_agent()</dt><dd>更加浏览器随意的user_agent</dd>
<dt>phone_number()</dt><dd>随意的电话号码</dd>
<dt>boolean()</dt><dd>随意的bool值</dd>
<dt>country_code()</dt><dd>城市代码</dd>
<dt>language_code()</dt><dd>en</dd>
<dt>locale()</dt><dd>zh_CN</dd>
<dt>md5()</dt><dd>随意的md5值</dd>
<dt>null_boolean()</dt><dd>None or True or False</dd>
<dt>sha1()</dt><dd>sha1值</dd>
<dt>sha256()</dt><dd>随意sha256值</dd>
</dl>


<p>
此外还有:
</p>
<pre>
fake.linux_platform_token()        # X11; Linux x86_64
fake.linux_processor()             # x86_64
fake.mac_platform_token()          # Macintosh; U; PPC Mac OS X 10_7_6
fake.mac_processor()                # U; PPC
fake.windows_platform_token()      # Windows 98; Win 9x 4.90
</pre>


<pre>
fake.company_email()               # ggreenfelder@ortizmedhurst.com
fake.domain_name()                 # mayer.com
fake.domain_word()                 # gusikowski
fake.email()                       # gbrakus@johns.net
fake.free_email()                  # abbey60@yahoo.com
fake.free_email_domain()           # hotmail.com
fake.ipv4()                        # 81.132.249.71
fake.ipv6()                        # 4c55:8c8b:54b5:746d:44ed:c7ab:486a:a50e
fake.safe_email()                  # amalia49@example.com
fake.slug()                        # TypeError
fake.tld()                         # net
fake.uri()                         # http://www.parker.com/
fake.uri_extension()               # .asp
fake.uri_page()                    # terms
fake.uri_path()                    # explore/list/app
fake.url()                         # http://dubuque.info/
fake.user_name()                   # goodwin.edwin
</pre>


<pre>
fake.bs()                          # maximize end-to-end infrastructures
fake.catch_phrase()                # Multi-tiered analyzing instructionset
fake.company()                     # Stanton-Luettgen
fake.company_suffix()              # Group
</pre>


<pre>
fake.am_pm()                       # AM
fake.century()                     # IX
fake.date()                        # 1985-02-17
fake.date_time()                   # 1995-06-08 14:46:50
fake.date_time_ad()                # 1927-12-17 23:08:46
fake.date_time_between()           # 1999-08-22 22:49:52
fake.date_time_this_century()      # 1999-07-24 23:35:49
fake.date_time_this_decade()       # 2008-01-27 01:08:37
fake.date_time_this_month()        # 2012-11-12 14:13:04
fake.date_time_this_year()         # 2012-05-19 00:40:00
fake.day_of_month()                # 23
fake.day_of_week()                 # Friday
fake.iso8601()                     # 2009-04-09T21:30:02
fake.month()                       # 03
fake.month_name()                  # April
fake.time()                        # 06:16:50
fake.timezone()                    # America/Noronha
fake.unix_time()                   # 275630166
fake.year()                        # 2002
</pre>


<pre>
fake.first_name()                  # Elton
fake.last_name()                   # Schowalter
fake.name()                        # Susan Pagac III
fake.prefix()                      # Ms.
fake.suffix()                      # V
</pre>


<pre>
fake.address()                     # 044 Watsica Brooks
                                     West Cedrickfort, SC 35023-5157
fake.building_number()             # 319
fake.city()                        # Kovacekfort
fake.city_prefix()                 # New
fake.city_suffix()                 # ville
fake.country()                     # Monaco
fake.geo_coordinate()              # 148.031951
fake.latitude()                    # 154.248666
fake.longitude()                   # 109.920335
fake.postcode()                    # 82402-3206
fake.secondary_address()           # Apt. 230
fake.state()                       # Nevada
fake.state_abbr()                  # NC
fake.street_address()              # 793 Haskell Stravenue
fake.street_name()                 # Arvilla Valley
fake.street_suffix()               # Crescent
</pre>


<pre>
fake.paragraph()                   # Itaque quia harum est autem inventore quisquam eaque. Facere mollitia repudiandae
                                     qui et voluptas. Consequatur sunt ullam blanditiis aliquam veniam illum voluptatem.
fake.paragraphs()                  # ['Alias porro soluta eum voluptate. Iste consequatur qui non nam.',
                                        'Id eum sint eius earum veniam fugiat ipsum et. Et et occaecati at labore
                                        amet et. Rem velit inventore consequatur facilis. Eum consequatur consequatur
                                        quis nobis.', 'Harum autem autem totam ex rerum adipisci magnam adipisci.
                                        Qui modi eos eum vel quisquam. Tempora quas eos dolorum sint voluptatem
                                        tenetur cum. Recusandae ducimus deleniti magnam ullam adipisci ipsa.']
fake.sentence()                    # Eum magni soluta unde minus nobis.
fake.sentences()                   # ['Ipsam eius aut veritatis iusto.',
                                        'Occaecati libero a aut debitis sunt quas deserunt aut.',
                                        'Culpa dolor voluptatum laborum at et enim.']
fake.text()                        # Dicta quo eius possimus quae eveniet cum nihil. Saepe sint non nostrum.
                                     Sequi est sit voluptate et eos eum et. Pariatur non sunt distinctio magnam.
fake.word()                        # voluptas
fake.words()                       # ['optio', 'et', 'voluptatem']
</pre>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline3">设置随机种子</h2>
<div class="outline-text-2" id="text-3">
<pre>
from faker import Faker
fake = Faker()
fake.seed(4321)

print fake.name()   # Margaret Boehm
</pre>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline4">语言locale代码</h2>
<div class="outline-text-2" id="text-4">
<pre>
bg_BG - Bulgarian
cs_CZ - Czech
de_DE - German
dk_DK - Danish
el_GR - Greek
en_CA - English (Canada)
en_GB - English (Great Britain)
en_US - English (United States)
es_ES - Spanish (Spain)
es_MX - Spanish (Mexico)
fa_IR - Persian (Iran)
fi_FI - Finnish
fr_FR - French
hi_IN - Hindi
it_IT - Italian
ja_JP - Japanese
ko_KR - Korean
lt_LT - Lithuanian
lv_LV - Latvian
ne_NP - Nepali
nl_NL - Dutch (Netherlands)
no_NO - Norwegian
pl_PL - Polish
pt_BR - Portuguese (Brazil)
pt_PT - Portuguese (Portugal)
ru_RU - Russian
sl_SI - Slovene
sv_SE - Swedish
tr_TR - Turkish
zh_CN - Chinese (China)
zh_TW - Chinese (Taiwan)
</pre>
</div>
</div>
</div>
</body>
</html>
